// เริ่มเขียนโค้ดตรงนี้
/*
* 1. ให้สร้าง Function `printPattern` Function นี้จะรับตัวเลขเข้ามา 1 ตัว แล้วแสดงผลลัพธ์ตามตัวเลขที่ได้รับมา เช่น ถ้าตัวเลขที่รับมาคือ 5 จะได้ผลลัพธ์ดังนี้
    
    ```jsx
    1
    1 2
    1 2 3
    1 2 3 4
    1 2 3 4 5
    ```
    
    คำอธิบายผลลัพธ์ 
    
    * แต่ละแถวจะแสดงตัวเลขเรียงกันตั้งแต่ 1 ไปจนถึงหมายเลขแถว เช่น แถวที่ 1 จะนับถึงแค่ 1 แถวที่ 5 จะนับตั้งแต่ 1-5
    * จำนวนแถวจะเท่ากับตัวเลขที่รับเข้ามา (ในกรณีนี้คือ 5)
    * Function นี้ต้องสามารถทำงานได้กับตัวเลขที่แตกต่างกัน เช่น
        - ถ้าใส่เลข 3 ก็จะได้ 3 แถว
        - ถ้าใส่เลข 10 ก็จะได้ 10 แถว 
*/
function printPattern(n) {
  let finalResult = "";
  for (let i = 1; i <= n; i++) {
    let rowResult = "";
    for (let j = 1; j <= i; j++) {
      rowResult += j + "\t";
    }
    console.log(`รอบที่ ${i} ได้ ${rowResult}`);
    finalResult += rowResult + "\n";
  }
  return finalResult;
}

console.log(printPattern(3));
